In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [4]:
print("hello")

hello

In [13]:
#indexing the data elements 
x=(10,20,30,49,45,56)

ser1=pd.Series(x)
print(ser1)

0    10
1    20
2    30
3    49
4    45
5    56
dtype: int64

# dictionary

In [16]:
dict={'a':[1,2,4],'b':[5,8,9],'c':[1,5,8]}
df=pd.DataFrame(dict)
df

   a  b  c
0  1  5  1
1  2  8  5
2  4  9  8

In [24]:
df['states']="ca,nv,az".split(",")
df

   a  b  c states
0  1  5  1     ca
1  2  8  5     nv
2  4  9  8     az

In [26]:
df['stat']="ca nv az".split( )
df

   a  b  c states stat
0  1  5  1     ca   ca
1  2  8  5     nv   nv
2  4  9  8     az   az

In [27]:
df['stat']='ca nv az'.split( )
df

   a  b  c states stat
0  1  5  1     ca   ca
1  2  8  5     nv   nv
2  4  9  8     az   az

In [3]:
dict={'a':[1,2,np.nan],'b':[5,np.nan,None],'c':[1,5,8]}
df=pd.DataFrame(dict)
df

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  5
2  NaN  NaN  8

In [4]:
#filling values in the pos of none

z= df.fillna(4)
z

     a    b  c
0  1.0  5.0  1
1  2.0  4.0  5
2  4.0  4.0  8

In [49]:
#dropping the rows containing null values

print(df.dropna(axis=0))

     a    b  c
0  1.0  5.0  1

In [51]:
#dropping the col containing null values

print(df.dropna(axis=1))

   c
0  1
1  5
2  8

In [5]:
data={'company':['goog','goog','msft','msft'],'person':['sam','charlie','amy','vanessa'],
      'sales':[200,120,340,124]}
df=pd.DataFrame(data)
df

  company   person  sales
0    goog      sam    200
1    goog  charlie    120
2    msft      amy    340
3    msft  vanessa    124

In [62]:
#gropu by company and find sum
group=df.groupby('company')
print(group.sum())

         sales
company
goog       320
msft       464

In [63]:
print(group.mean())

         sales
company
goog     160.0
msft     232.0

In [74]:
class_a=pd.DataFrame({'mat':[45,68,35],'eng':[54,87,36],
                      'chem':[54,77,88]},index=['ravi','syam','abhi'])
class_b=pd.DataFrame({'mat':[40,60,65],'eng':[55,43,57],
                      'chem':[56,87,98]},index=['ram','siri','arun'])
class_c=pd.DataFrame({'mat':[40,60,65],'eng':[55,43,57],
                      'chem':[56,87,98]},index=['ram','siri','arun'])
class_a

      mat  eng  chem
ravi   45   54    54
syam   68   87    77
abhi   35   36    88

In [69]:
class_b

      mat  eng  chem
ram    40   55    56
siri   60   43    87
arun   65   57    98

# concatination

In [75]:
dfcat1=pd.concat([class_a,class_b,class_c],axis=0)
dfcat1

      mat  eng  chem
ravi   45   54    54
syam   68   87    77
abhi   35   36    88
ram    40   55    56
siri   60   43    87
arun   65   57    98
ram    40   55    56
siri   60   43    87
arun   65   57    98

In [77]:
dfcat1=pd.concat([class_a,class_b,class_c],axis=1)
dfcat1

       mat   eng  chem   mat   eng  chem   mat   eng  chem
ravi  45.0  54.0  54.0   NaN   NaN   NaN   NaN   NaN   NaN
syam  68.0  87.0  77.0   NaN   NaN   NaN   NaN   NaN   NaN
abhi  35.0  36.0  88.0   NaN   NaN   NaN   NaN   NaN   NaN
ram    NaN   NaN   NaN  40.0  55.0  56.0  40.0  55.0  56.0
siri   NaN   NaN   NaN  60.0  43.0  87.0  60.0  43.0  87.0
arun   NaN   NaN   NaN  65.0  57.0  98.0  65.0  57.0  98.0

# merge

In [2]:
player_id_name=pd.DataFrame({'ID':[24,34,56,67,74,32,34],
                            'name':['ron','mess','pele','mara','hary','pog','chetri']})
                            
player_id_name=pd.DataFrame({'ID':[24,34,56,67,74,32,34],
                             'age':[23,45,67,78,86,56,78],
                            'country':['port','argen','eng','france','india','us','brazil']})

In [88]:
#default will be how=inner
pd.merge(player_id_name,player_id_name,on='ID')

   ID  name_x  name_y
0  24     ron     ron
1  34    mess    mess
2  34    mess  chetri
3  34  chetri    mess
4  34  chetri  chetri
5  56    pele    pele
6  67    mara    mara
7  74    hary    hary
8  32     pog     pog

In [4]:
pd.merge(player_id_name,player_id_name,how='outer',on='ID')

   ID  age_x country_x  age_y country_y
0  24     23      port     23      port
1  34     45     argen     45     argen
2  34     45     argen     78    brazil
3  34     78    brazil     45     argen
4  34     78    brazil     78    brazil
5  56     67       eng     67       eng
6  67     78    france     78    france
7  74     86     india     86     india
8  32     56        us     56        us

In [5]:
pd.merge(player_id_name,player_id_name)

   ID  age country
0  24   23    port
1  34   45   argen
2  56   67     eng
3  67   78  france
4  74   86   india
5  32   56      us
6  34   78  brazil

In [97]:
matrix_data=np.matrix('22,66,140;42,70,148;30,62,125;35,68,160')
row_labels=['raju','pandey','srini','sunil']
col_headings=['age','height','weight']

df=pd.DataFrame(data=matrix_data,index=row_labels,columns=col_headings)
df

        age  height  weight
raju     22      66     140
pandey   42      70     148
srini    30      62     125
sunil    35      68     160

In [99]:
print(df.loc['pandey','height'])

70

In [102]:
print(df.loc[['srini','sunil'],['height','weight']])

       height  weight
srini      62     125
sunil      68     160

In [108]:
df1=df['height']>65
df2=df['weight']>145
print(df[(df1)&(df2)])

        age  height  weight
pandey   42      70     148
sunil    35      68     160

In [13]:
left=pd.DataFrame({'A':['A0','A1','A2'],
                  'B':['B0','B1','B2']},
                  index=['k0','k1','k2']
                 )

In [14]:
left

     A   B
k0  A0  B0
k1  A1  B1
k2  A2  B2

In [18]:
right=pd.DataFrame({'C':['C0','C2','C3'],'D':['D0','D2','D3']},
                  index=['k0','k2','k3'])

In [19]:
right

     C   D
k0  C0  D0
k2  C2  D2
k3  C3  D3

In [ ]:
#17july end session

In [20]:
left.join(right)

     A   B    C    D
k0  A0  B0   C0   D0
k1  A1  B1  NaN  NaN
k2  A2  B2   C2   D2

In [21]:
left.join(right,how='outer')

      A    B    C    D
k0   A0   B0   C0   D0
k1   A1   B1  NaN  NaN
k2   A2   B2   C2   D2
k3  NaN  NaN   C3   D3